クラス：C　学籍番号：b2181930　氏名：西村貴志

In [1]:
import pandas as pd

In [2]:
from pandas import Series

In [3]:
s_data = pd.Series([0,10,20,30,40])
print(s_data)

0     0
1    10
2    20
3    30
4    40
dtype: int64

In [4]:
print('s_data')
print('data:', s_data.values)
print('index:', s_data.index)

s_data
data: [ 0 10 20 30 40]
index: RangeIndex(start=0, stop=5, step=1)

In [5]:
s_data2 = pd.Series(
    [0,10,20,30,40],
    index=['a','b','c','d','e'])
print(s_data2)

a     0
b    10
c    20
d    30
e    40
dtype: int64

In [6]:
print('s_data2')
print('data:',s_data2.values)
print('index:',s_data2.index)

s_data2
data: [ 0 10 20 30 40]
index: Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
from pandas import DataFrame

In [8]:
t_data1 = {'ID':['100','200','300','400'],
           'Name':['John','Richard','Steve','Ellen'],
           'City':['New York','New York','Seattle','Washington'],
           'Age':[30,46,21,18]}
f_data1 = DataFrame(t_data1)
print(f_data1)

    ID     Name        City  Age
0  100     John    New York   30
1  200  Richard    New York   46
2  300    Steve     Seattle   21
3  400    Ellen  Washington   18

In [9]:
f_data2 = DataFrame(t_data1,index=['a','b','c','d'])
print(f_data2)

    ID     Name        City  Age
a  100     John    New York   30
b  200  Richard    New York   46
c  300    Steve     Seattle   21
d  400    Ellen  Washington   18

In [10]:
f_data2

    ID     Name        City  Age
a  100     John    New York   30
b  200  Richard    New York   46
c  300    Steve     Seattle   21
d  400    Ellen  Washington   18

In [11]:
f_data1.T

             0         1        2           3
ID         100       200      300         400
Name      John   Richard    Steve       Ellen
City  New York  New York  Seattle  Washington
Age         30        46       21          18

In [12]:
f_data1.Age

0    30
1    46
2    21
3    18
Name: Age, dtype: int64

In [13]:
f_data1.Name

0       John
1    Richard
2      Steve
3      Ellen
Name: Name, dtype: object

In [14]:
f_data1[['Name', 'City']]

      Name        City
0     John    New York
1  Richard    New York
2    Steve     Seattle
3    Ellen  Washington

In [15]:
f_data1[f_data1['City'] == 'New York']

    ID     Name      City  Age
0  100     John  New York   30
1  200  Richard  New York   46

In [16]:
f_data1[f_data1['City'].isin(['New York', 'Washington'])]

    ID     Name        City  Age
0  100     John    New York   30
1  200  Richard    New York   46
3  400    Ellen  Washington   18

In [17]:
f_data1.drop({'Age'}, axis = 1)

    ID     Name        City
0  100     John    New York
1  200  Richard    New York
2  300    Steve     Seattle
3  400    Ellen  Washington

In [18]:
f_data1

    ID     Name        City  Age
0  100     John    New York   30
1  200  Richard    New York   46
2  300    Steve     Seattle   21
3  400    Ellen  Washington   18

In [19]:
f_data2 = f_data1.drop(['Age'], axis = 1)
f_data2

    ID     Name        City
0  100     John    New York
1  200  Richard    New York
2  300    Steve     Seattle
3  400    Ellen  Washington

In [20]:
f_data1

    ID     Name        City  Age
0  100     John    New York   30
1  200  Richard    New York   46
2  300    Steve     Seattle   21
3  400    Ellen  Washington   18

In [21]:
f_data2.drop([1,3], axis=0)

    ID   Name      City
0  100   John  New York
2  300  Steve   Seattle

In [22]:
f_data2

    ID     Name        City
0  100     John    New York
1  200  Richard    New York
2  300    Steve     Seattle
3  400    Ellen  Washington

In [23]:
t_data3 = {'ID':['100','200','300','400'],
           'Class':['A','B','B','A'],
           'Math':[100,49,78,87],
           'Eng':[43,80,83,90]}
f_data3 = DataFrame(t_data3)
f_data3

    ID Class  Math  Eng
0  100     A   100   43
1  200     B    49   80
2  300     B    78   83
3  400     A    87   90

In [24]:
pd.merge(f_data1, f_data3)

    ID     Name        City  Age Class  Math  Eng
0  100     John    New York   30     A   100   43
1  200  Richard    New York   46     B    49   80
2  300    Steve     Seattle   21     B    78   83
3  400    Ellen  Washington   18     A    87   90

In [25]:
print(f_data3.groupby('Class')['Math'].mean())
print(f_data3.groupby('Class')['Math'].max())

Class
A    93.5
B    63.5
Name: Math, dtype: float64
Class
A    100
B     78
Name: Math, dtype: int64

In [26]:
f_data3.Math.sort_values()

1     49
2     78
3     87
0    100
Name: Math, dtype: int64

In [27]:
f_data3.sort_values('Math')

    ID Class  Math  Eng
1  200     B    49   80
2  300     B    78   83
3  400     A    87   90
0  100     A   100   43

In [28]:
f_data3.sort_values('Math',ascending=False)

    ID Class  Math  Eng
0  100     A   100   43
3  400     A    87   90
2  300     B    78   83
1  200     B    49   80

In [29]:
import numpy as np
f_data3 = f_data3.replace('B',np.nan)
f_data3

    ID Class  Math  Eng
0  100     A   100   43
1  200   NaN    49   80
2  300   NaN    78   83
3  400     A    87   90

In [30]:
f_data3.isnull()

      ID  Class   Math    Eng
0  False  False  False  False
1  False   True  False  False
2  False   True  False  False
3  False  False  False  False

In [31]:
f_data3.isnull().sum()

ID       0
Class    2
Math     0
Eng      0
dtype: int64

In [32]:
f_data3 = f_data3.replace(np.nan,'X')
f_data3

    ID Class  Math  Eng
0  100     A   100   43
1  200     X    49   80
2  300     X    78   83
3  400     A    87   90

***
# 演習

In [33]:
t_data4 = {'ID':['123','456','789','987','654','321'],
           'Name':['raccoon','dog','wild boar','rabbit','cow','horse'],
           'Ability':['punch','bite','rush','bounce','lean','kick'],
           'HP':[10,15,20,5,30,25],
           'Power':[10,20,30,3,15,30]}
f_data4 = DataFrame(t_data4)
print(f_data4)

f_data5 = DataFrame(t_data4,index=['A','B','C','D','E','F'])
print(f_data5)

    ID       Name Ability  HP  Power
0  123    raccoon   punch  10     10
1  456        dog    bite  15     20
2  789  wild boar    rush  20     30
3  987     rabbit  bounce   5      3
4  654        cow    lean  30     15
5  321      horse    kick  25     30
    ID       Name Ability  HP  Power
A  123    raccoon   punch  10     10
B  456        dog    bite  15     20
C  789  wild boar    rush  20     30
D  987     rabbit  bounce   5      3
E  654        cow    lean  30     15
F  321      horse    kick  25     30

In [34]:
f_data5

    ID       Name Ability  HP  Power
A  123    raccoon   punch  10     10
B  456        dog    bite  15     20
C  789  wild boar    rush  20     30
D  987     rabbit  bounce   5      3
E  654        cow    lean  30     15
F  321      horse    kick  25     30

In [35]:
f_data4.T

               0     1          2       3     4      5
ID           123   456        789     987   654    321
Name     raccoon   dog  wild boar  rabbit   cow  horse
Ability    punch  bite       rush  bounce  lean   kick
HP            10    15         20       5    30     25
Power         10    20         30       3    15     30

In [36]:
f_data4.HP

0    10
1    15
2    20
3     5
4    30
5    25
Name: HP, dtype: int64

In [37]:
f_data4.Ability

0     punch
1      bite
2      rush
3    bounce
4      lean
5      kick
Name: Ability, dtype: object

In [38]:
f_data4[['Name', 'Power']]

        Name  Power
0    raccoon     10
1        dog     20
2  wild boar     30
3     rabbit      3
4        cow     15
5      horse     30

In [39]:
f_data4[f_data4['Power'] == 30]

    ID       Name Ability  HP  Power
2  789  wild boar    rush  20     30
5  321      horse    kick  25     30

In [40]:
f_data4[f_data4['Ability'].isin(['punch', 'bounce'])]

    ID     Name Ability  HP  Power
0  123  raccoon   punch  10     10
3  987   rabbit  bounce   5      3

In [41]:
f_data4.drop({'Ability'}, axis = 1)

    ID       Name  HP  Power
0  123    raccoon  10     10
1  456        dog  15     20
2  789  wild boar  20     30
3  987     rabbit   5      3
4  654        cow  30     15
5  321      horse  25     30

In [42]:
f_data4

    ID       Name Ability  HP  Power
0  123    raccoon   punch  10     10
1  456        dog    bite  15     20
2  789  wild boar    rush  20     30
3  987     rabbit  bounce   5      3
4  654        cow    lean  30     15
5  321      horse    kick  25     30

In [43]:
f_data5 = f_data4.drop(['Ability'], axis = 1)
f_data5

    ID       Name  HP  Power
0  123    raccoon  10     10
1  456        dog  15     20
2  789  wild boar  20     30
3  987     rabbit   5      3
4  654        cow  30     15
5  321      horse  25     30

In [44]:
f_data4

    ID       Name Ability  HP  Power
0  123    raccoon   punch  10     10
1  456        dog    bite  15     20
2  789  wild boar    rush  20     30
3  987     rabbit  bounce   5      3
4  654        cow    lean  30     15
5  321      horse    kick  25     30

In [45]:
f_data5.drop([2,4], axis=0)

    ID     Name  HP  Power
0  123  raccoon  10     10
1  456      dog  15     20
3  987   rabbit   5      3
5  321    horse  25     30

In [46]:
f_data5

    ID       Name  HP  Power
0  123    raccoon  10     10
1  456        dog  15     20
2  789  wild boar  20     30
3  987     rabbit   5      3
4  654        cow  30     15
5  321      horse  25     30

In [47]:
t_data6 = {'ID':['123','456','789','987','654','321'],
           'Weapon':['boots','fang','fang','carrots','nose ring','hoof'],
           'MP':[15,15,10,30,20,10],
           'Defense':[5,10,15,10,20,20],
           'Speed':[40,50,60,50,30,80]}
f_data6 = DataFrame(t_data6)
f_data6

    ID     Weapon  MP  Defense  Speed
0  123      boots  15        5     40
1  456       fang  15       10     50
2  789       fang  10       15     60
3  987    carrots  30       10     50
4  654  nose ring  20       20     30
5  321       hoof  10       20     80

In [48]:
pd.merge(f_data4, f_data6)

    ID       Name Ability  HP  Power     Weapon  MP  Defense  Speed
0  123    raccoon   punch  10     10      boots  15        5     40
1  456        dog    bite  15     20       fang  15       10     50
2  789  wild boar    rush  20     30       fang  10       15     60
3  987     rabbit  bounce   5      3    carrots  30       10     50
4  654        cow    lean  30     15  nose ring  20       20     30
5  321      horse    kick  25     30       hoof  10       20     80

In [49]:
print(f_data6.groupby('Weapon')['Defense'].mean())
print(f_data6.groupby('Weapon')['Defense'].max())

Weapon
boots         5.0
carrots      10.0
fang         12.5
hoof         20.0
nose ring    20.0
Name: Defense, dtype: float64
Weapon
boots         5
carrots      10
fang         15
hoof         20
nose ring    20
Name: Defense, dtype: int64

In [50]:
f_data6.Defense.sort_values()

0     5
1    10
3    10
2    15
4    20
5    20
Name: Defense, dtype: int64

In [51]:
f_data6.sort_values('Defense')

    ID     Weapon  MP  Defense  Speed
0  123      boots  15        5     40
1  456       fang  15       10     50
3  987    carrots  30       10     50
2  789       fang  10       15     60
4  654  nose ring  20       20     30
5  321       hoof  10       20     80

In [52]:
f_data6.sort_values('Defense',ascending=False)

    ID     Weapon  MP  Defense  Speed
4  654  nose ring  20       20     30
5  321       hoof  10       20     80
2  789       fang  10       15     60
1  456       fang  15       10     50
3  987    carrots  30       10     50
0  123      boots  15        5     40

In [53]:
f_data6 = f_data6.replace(15,np.nan)
f_data6

    ID     Weapon    MP  Defense  Speed
0  123      boots   NaN      5.0     40
1  456       fang   NaN     10.0     50
2  789       fang  10.0      NaN     60
3  987    carrots  30.0     10.0     50
4  654  nose ring  20.0     20.0     30
5  321       hoof  10.0     20.0     80

In [54]:
f_data6.isnull()

      ID  Weapon     MP  Defense  Speed
0  False   False   True    False  False
1  False   False   True    False  False
2  False   False  False     True  False
3  False   False  False    False  False
4  False   False  False    False  False
5  False   False  False    False  False

In [55]:
f_data6.isnull().sum()

ID         0
Weapon     0
MP         2
Defense    1
Speed      0
dtype: int64

In [56]:
f_data6 = f_data6.replace(np.nan,255)
f_data6

    ID     Weapon     MP  Defense  Speed
0  123      boots  255.0      5.0     40
1  456       fang  255.0     10.0     50
2  789       fang   10.0    255.0     60
3  987    carrots   30.0     10.0     50
4  654  nose ring   20.0     20.0     30
5  321       hoof   10.0     20.0     80